// JavaScript Document
cityareaname=new Array(35);
cityareacode=new Array(35);
function first(preP,preC,formname,selectP,selectC)
{
a=0;
if (selectP=='01')
{ a=1;tempoption=new Option('北京','京',false,true); }
else
{ tempoption=new Option('北京','京'); }
eval('document.'+formname+'.'+preP+'.options[1]=tempoption;');
cityareacode[0]=new Array('110101','110102','110103','110104','110105','110106','110107','110108','110109','110111','110112','110113','110114','110115','110116','110117','110228','110229');
cityareaname[0]=new Array('东城区','西城区','崇文区','宣武区','朝阳区','丰台区','石景山区','海淀区','门头沟区','房山区','通州区','顺义区','昌平区','大兴区','怀柔区','平谷区','密云县','延庆县');
if (selectP=='02')
{ a=2;tempoption=new Option('新疆','新',false,true); }
else
{ tempoption=new Option('新疆','新'); }
eval('document.'+formname+'.'+preP+'.options[2]=tempoption;');
cityareacode[1]=new Array('650100','650200','652101','652201','652301','652302','652303','652701','652801','652901','653001','653101','653201','654002','654003','654201','654202','654301','659001','659002','659003','659004');
cityareaname[1]=new Array('乌鲁木齐市','克拉玛依市','吐鲁番市','哈密市','昌吉市','阜康市','米泉市','博乐市','库尔勒市','阿克苏市','阿图什市','喀什市','和田市','伊宁市','奎屯市','塔城市','乌苏市','阿勒泰市','石河子市','阿拉尔市','图木舒克市','五家渠市');
if (selectP=='03')
{ a=3;tempoption=new Option('上海','沪',false,true); }
else
{ tempoption=new Option('上海','沪'); }
eval('document.'+formname+'.'+preP+'.options[3]=tempoption;');
cityareacode[2]=new Array('310101','310103','310104','310105','310106','310107','310108','310109','310110','310112','310113','310114','310115','310116','310117','310118','310119','310120');
cityareaname[2]=new Array('黄浦区','卢湾区','徐汇区','长宁区','静安区','普陀区','闸北区','虹口区','杨浦区','闵行区','宝山区','嘉定区','浦东新区','金山区','松江区','青浦区','南汇区','奉贤区');
if (selectP=='04')
{ a=4;tempoption=new Option('重庆','渝',false,true); }
else
{ tempoption=new Option('重庆','渝'); }
eval('document.'+formname+'.'+preP+'.options[4]=tempoption;');
cityareacode[3]=new Array('500100','500101','500102','500103','500104','500105','500106','500107','500108','500109','500110','500111','500112','500113','500114','500115','500116','500117','500118','500119');
cityareaname[3]=new Array('市辖区','万州区','涪陵区','渝中区','大渡口区','江北区','沙坪坝区','九龙坡区','南岸区','北碚区','万盛区','双桥区','渝北区','巴南区','黔江区','长寿区','江津区','合川区','永川区','南川区');
if (selectP=='05')
{ a=5;tempoption=new Option('天津','津',false,true); }
else
{ tempoption=new Option('天津','津'); }
eval('document.'+formname+'.'+preP+'.options[5]=tempoption;');
cityareacode[4]=new Array('120101','120102','120103','120104','120105','120106','120107','120108','120109','120110','120111','120112','120113','120114','120115');
cityareaname[4]=new Array('和平区','河东区','河西区','南开区','河北区','红桥区','塘沽区','汉沽区','大港区','东丽区','西青区','津南区','北辰区','武清区','宝坻区');
if (selectP=='06')
{ a=6;tempoption=new Option('广东','粤',false,true); }
else
{ tempoption=new Option('广东','粤'); }
eval('document.'+formname+'.'+preP+'.options[6]=tempoption;');
cityareacode[5]=new Array('440100','440183','440184','440200','440281','440282','440300','440400','440600','440700','440781','440783','440784','440785','440800','440881','440882','440883','440900','440981','440982','440983','441200','441283','441284','441300','441400','441481','441500','441581','441600','441700','441781','441800','441881','441882','441900','442000','445100','445200','445281','445300','445381');
cityareaname[5]=new Array('广州市','增城市','从化市','韶关市','乐昌市','南雄市','深圳市','珠海市','佛山市','江门市','台山市','开平市','鹤山市','恩平市','湛江市','廉江市','雷州市','吴川市','茂名市','高州市','化州市','信宜市','肇庆市','高要市','四会市','惠州市','梅州市','兴宁市','汕尾市','陆丰市','河源市','阳江市','阳春市','清远市','英德市','连州市','东莞市','中山市','潮州市','揭阳市','普宁市','云浮市','罗定市');
if (selectP=='07')
{ a=7;tempoption=new Option('河北','冀',false,true); }
else
{ tempoption=new Option('河北','冀'); }
eval('document.'+formname+'.'+preP+'.options[7]=tempoption;');
cityareacode[6]=new Array('130100','130181','130182','130183','130184','130185','130200','130281','130283','130300','130400','130481','130500','130581','130582','130600','130681','130682','130683','130684','130700','130800','130900','130981','130982','130983','130984','131000','131081','131082','131100','131181','131182');
cityareaname[6]=new Array('石家庄市','辛集市','藁城市','晋州市','新乐市','鹿泉市','唐山市','遵化市','迁安市','秦皇岛市','邯郸市','武安市','邢台市','南宫市','沙河市','保定市','涿州市','定州市','安国市','高碑店市','张家口市','承德市','沧州市','泊头市','任丘市','黄骅市','河间市','廊坊市','霸州市','三河市','衡水市','冀州市','深州市');
if (selectP=='08')
{ a=8;tempoption=new Option('山西','晋',false,true); }
else
{ tempoption=new Option('山西','晋'); }
eval('document.'+formname+'.'+preP+'.options[8]=tempoption;');
cityareacode[7]=new Array('140100','140181','140200','140300','140400','140481','140500','140581','140600','140700','140781','140800','140881','140882','140900','140981','141000','141081','141082','141100','141181','141182');
cityareaname[7]=new Array('太原市','古交市','大同市','阳泉市','长治市','潞城市','晋城市','高平市','朔州市','晋中市','介休市','运城市','永济市','河津市','忻州市','原平市','临汾市','侯马市','霍州市','吕梁市','孝义市','汾阳市');
if (selectP=='09')
{ a=9;tempoption=new Option('内蒙古','蒙',false,true); }
else
{ tempoption=new Option('内蒙古','蒙'); }
eval('document.'+formname+'.'+preP+'.options[9]=tempoption;');
cityareacode[8]=new Array('150100','150200','150300','150400','150500','150700','150781','150782','150783','150784','150785','150800','150900','150981','152201','152202','152501','152502');
cityareaname[8]=new Array('呼和浩特市','包头市','乌海市','赤峰市','通辽市','呼伦贝尔市','满洲里市','牙克石市','扎兰屯市','额尔古纳市','根河市','巴彦淖尔市','乌兰察布市','丰镇市','乌兰浩特市','阿尔山市','二连浩特市','锡林浩特市');
if (selectP=='10')
{ a=10;tempoption=new Option('辽宁','辽',false,true); }
else
{ tempoption=new Option('辽宁','辽'); }
eval('document.'+formname+'.'+preP+'.options[10]=tempoption;');
cityareacode[9]=new Array('210100','210181','210200','210281','210282','210283','210300','210381','210400','210500','210600','210681','210682','210700','210781','210782','210800','210881','210882','210900','211000','211081','211100','211200','211281','211282','211300','211381','211382','211400','211481');
cityareaname[9]=new Array('沈阳市','新民市','大连市','瓦房店市','普兰店市','庄河市','鞍山市','海城市','抚顺市','本溪市','丹东市','东港市','凤城市','锦州市','凌海市','北镇市','营口市','盖州市','大石桥市','阜新市','辽阳市','灯塔市','盘锦市','铁岭市','调兵山市','开原市','朝阳市','北票市','凌源市','葫芦岛市','兴城市');
if (selectP=='11')
{ a=11;tempoption=new Option('吉林','吉',false,true); }
else
{ tempoption=new Option('吉林','吉'); }
eval('document.'+formname+'.'+preP+'.options[11]=tempoption;');
cityareacode[10]=new Array('220100','220181','220182','220183','220200','220281','220282','220283','220284','220300','220381','220382','220400','220500','220581','220582','220600','220681','220700','220800','220881','220882','222401','222402','222403','222404','222405','222406');
cityareaname[10]=new Array('长春市','九台市','榆树市','德惠市','吉林市','蛟河市','桦甸市','舒兰市','磐石市','四平市','公主岭市','双辽市','辽源市','通化市','梅河口市','集安市','白山市','临江市','松原市','白城市','洮南市','大安市','延吉市','图们市','敦化市','珲春市','龙井市','和龙市');
if (selectP=='12')
{ a=12;tempoption=new Option('黑龙江','黑',false,true); }
else
{ tempoption=new Option('黑龙江','黑'); }
eval('document.'+formname+'.'+preP+'.options[12]=tempoption;');
cityareacode[11]=new Array('230100','230182','230183','230184','230200','230281','230300','230381','230382','230400','230500','230600','230700','230722','230781','230800','230881','230882','230900','231000','231081','231083','231084','231085','231100','231181','231182','231200','231281','231282','231283');
cityareaname[11]=new Array('哈尔滨市','双城市','尚志市','五常市','齐齐哈尔市','讷河市','鸡西市','虎林市','密山市','鹤岗市','双鸭山市','大庆市','伊春市','嘉荫县','铁力市','佳木斯市','同江市','富锦市','七台河市','牡丹江市','绥芬河市','海林市','宁安市','穆棱市','黑河市','北安市','五大连池市','绥化市','安达市','肇东市','海伦市');
if (selectP=='13')
{ a=13;tempoption=new Option('江苏','苏',false,true); }
else
{ tempoption=new Option('江苏','苏'); }
eval('document.'+formname+'.'+preP+'.options[13]=tempoption;');
cityareacode[12]=new Array('320100','320200','320281','320282','320300','320381','320382','320400','320481','320482','320500','320581','320582','320583','320584','320585','320600','320681','320682','320683','320684','320700','320800','320900','320981','320982','321000','321081','321084','321088','321100','321181','321182','321183','321200','321281','321282','321283','321284','321300');
cityareaname[12]=new Array('南京市','无锡市','江阴市','宜兴市','徐州市','新沂市','邳州市','常州市','溧阳市','金坛市','苏州市','常熟市','张家港市','昆山市','吴江市','太仓市','南通市','启东市','如皋市','通州市','海门市','连云港市','淮安市','盐城市','东台市','大丰市','扬州市','仪征市','高邮市','江都市','镇江市','丹阳市','扬中市','句容市','泰州市','兴化市','靖江市','泰兴市','姜堰市','宿迁市');
if (selectP=='14')
{ a=14;tempoption=new Option('浙江','浙',false,true); }
else
{ tempoption=new Option('浙江','浙'); }
eval('document.'+formname+'.'+preP+'.options[14]=tempoption;');
cityareacode[13]=new Array('330100','330182','330183','330185','330200','330281','330282','330283','330300','330381','330382','330400','330481','330482','330483','330500','330600','330681','330682','330683','330700','330781','330782','330783','330784','330800','330881','330900','331000','331081','331082','331100','331181');
cityareaname[13]=new Array('杭州市','建德市','富阳市','临安市','宁波市','余姚市','慈溪市','奉化市','温州市','瑞安市','乐清市','嘉兴市','海宁市','平湖市','桐乡市','湖州市','绍兴市','诸暨市','上虞市','嵊州市','金华市','兰溪市','义乌市','东阳市','永康市','衢州市','江山市','舟山市','台州市','温岭市','临海市','丽水市','龙泉市');
if (selectP=='15')
{ a=15;tempoption=new Option('安徽','皖',false,true); }
else
{ tempoption=new Option('安徽','皖'); }
eval('document.'+formname+'.'+preP+'.options[15]=tempoption;');
cityareacode[14]=new Array('340100','340200','340300','340400','340500','340600','340700','340800','340881','341000','341100','341181','341182','341200','341282','341300','341400','341500','341600','341700','341800','341881');
cityareaname[14]=new Array('合肥市','芜湖市','蚌埠市','淮南市','马鞍山市','淮北市','铜陵市','安庆市','桐城市','黄山市','滁州市','天长市','明光市','阜阳市','界首市','宿州市','巢湖市','六安市','亳州市','池州市','宣城市','宁国市');
if (selectP=='16')
{ a=16;tempoption=new Option('福建','闽',false,true); }
else
{ tempoption=new Option('福建','闽'); }
eval('document.'+formname+'.'+preP+'.options[16]=tempoption;');
cityareacode[15]=new Array('350100','350181','350182','350200','350300','350400','350481','350500','350581','350582','350583','350600','350681','350700','350781','350782','350783','350784','350800','350881','350900','350981','350982');
cityareaname[15]=new Array('福州市','福清市','长乐市','厦门市','莆田市','三明市','永安市','泉州市','石狮市','晋江市','南安市','漳州市','龙海市','南平市','邵武市','武夷山市','建瓯市','建阳市','龙岩市','漳平市','宁德市','福安市','福鼎市');
if (selectP=='17')
{ a=17;tempoption=new Option('江西','赣',false,true); }
else
{ tempoption=new Option('江西','赣'); }
eval('document.'+formname+'.'+preP+'.options[17]=tempoption;');
cityareacode[16]=new Array('360100','360200','360281','360300','360400','360481','360500','360600','360681','360700','360781','360782','360800','360881','360900','360981','360982','360983','361000','361100','361181');
cityareaname[16]=new Array('南昌市','景德镇市','乐平市','萍乡市','九江市','瑞昌市','新余市','鹰潭市','贵溪市','赣州市','瑞金市','南康市','吉安市','井冈山市','宜春市','丰城市','樟树市','高安市','抚州市','上饶市','德兴市');
if (selectP=='18')
{ a=18;tempoption=new Option('山东','鲁',false,true); }
else
{ tempoption=new Option('山东','鲁'); }
eval('document.'+formname+'.'+preP+'.options[18]=tempoption;');
cityareacode[17]=new Array('370100','370181','370200','370281','370282','370283','370284','370285','370300','370400','370481','370500','370600','370681','370682','370683','370684','370685','370686','370687','370700','370781','370782','370783','370784','370785','370786','370800','370881','370882','370883','370900','370982','370983','371000','371081','371082','371083','371100','371200','371300','371400','371481','371482','371500','371581','371600','371700');
cityareaname[17]=new Array('济南市','章丘市','青岛市','胶州市','即墨市','平度市','胶南市','莱西市','淄博市','枣庄市','滕州市','东营市','烟台市','龙口市','莱阳市','莱州市','蓬莱市','招远市','栖霞市','海阳市','潍坊市','青州市','诸城市','寿光市','安丘市','高密市','昌邑市','济宁市','曲阜市','兖州市','邹城市','泰安市','新泰市','肥城市','威海市','文登市','荣成市','乳山市','日照市','莱芜市','临沂市','德州市','乐陵市','禹城市','聊城市','临清市','滨州市','菏泽市');
if (selectP=='19')
{ a=19;tempoption=new Option('河南','豫',false,true); }
else
{ tempoption=new Option('河南','豫'); }
eval('document.'+formname+'.'+preP+'.options[19]=tempoption;');
cityareacode[18]=new Array('410181','410182','410183','410184','410185','410200','410300','410381','410400','410481','410482','410500','410581','410600','410700','410781','410782','410800','410881','410882','410883','410900','411000','411081','411082','411100','411200','411281','411282','411300','411381','411400','411481','411500','411600','411681','411700');
cityareaname[18]=new Array('巩义市','荥阳市','新密市','新郑市','登封市','开封市','洛阳市','偃师市','平顶山市','舞钢市','汝州市','安阳市','林州市','鹤壁市','新乡市','卫辉市','辉县市','焦作市','济源市','沁阳市','孟州市','濮阳市','许昌市','禹州市','长葛市','漯河市','三门峡市','义马市','灵宝市','南阳市','邓州市','商丘市','永城市','信阳市','周口市','项城市','驻马店市');
if (selectP=='20')
{ a=20;tempoption=new Option('湖北','鄂',false,true); }
else
{ tempoption=new Option('湖北','鄂'); }
eval('document.'+formname+'.'+preP+'.options[20]=tempoption;');
cityareacode[19]=new Array('420100','420200','420281','420300','420381','420500','420581','420582','420583','420600','420682','420683','420684','420700','420800','420881','420900','420981','420982','420984','421000','421081','421083','421087','421100','421181','421182','421200','421281','421300','421381','429004','429005','429006');
cityareaname[19]=new Array('武汉市','黄石市','大冶市','十堰市','丹江口市','宜昌市','宜都市','当阳市','枝江市','襄樊市','老河口市','枣阳市','宜城市','鄂州市','荆门市','钟祥市','孝感市','应城市','安陆市','汉川市','荆州市','石首市','洪湖市','松滋市','黄冈市','麻城市','武穴市','咸宁市','赤壁市','随州市','广水市','仙桃市','潜江市','天门市');
if (selectP=='21')
{ a=21;tempoption=new Option('湖南','湘',false,true); }
else
{ tempoption=new Option('湖南','湘'); }
eval('document.'+formname+'.'+preP+'.options[21]=tempoption;');
cityareacode[20]=new Array('430100','430181','430200','430281','430300','430381','430382','430400','430481','430482','430500','430581','430600','430681','430682','430700','430781','430800','430900','430981','431000','431081','431100','431200','431281','431300','431381','431382','433101');
cityareaname[20]=new Array('长沙市','浏阳市','株洲市','醴陵市','湘潭市','湘乡市','韶山市','衡阳市','耒阳市','常宁市','邵阳市','武冈市','岳阳市','汨罗市','临湘市','常德市','津市市','张家界市','益阳市','沅江市','郴州市','资兴市','永州市','怀化市','洪江市','娄底市','冷水江市','涟源市','吉首市');
if (selectP=='22')
{ a=22;tempoption=new Option('广西','桂',false,true); }
else
{ tempoption=new Option('广西','桂'); }
eval('document.'+formname+'.'+preP+'.options[22]=tempoption;');
cityareacode[21]=new Array('450100','450200','450300','450400','450481','450500','450600','450681','450700','450800','450881','450900','450981','451000','451100','451200','451281','451300','451381','451400','451481');
cityareaname[21]=new Array('南宁市','柳州市','桂林市','梧州市','岑溪市','北海市','防城港市','东兴市','钦州市','贵港市','桂平市','玉林市','北流市','百色市','贺州市','河池市','宜州市','来宾市','合山市','崇左市','凭祥市');
if (selectP=='23')
{ a=23;tempoption=new Option('海南','琼',false,true); }
else
{ tempoption=new Option('海南','琼'); }
eval('document.'+formname+'.'+preP+'.options[23]=tempoption;');
cityareacode[22]=new Array('460100');
cityareaname[22]=new Array('海口市');
if (selectP=='24')
{ a=24;tempoption=new Option('四川','川',false,true); }
else
{ tempoption=new Option('四川','川'); }
eval('document.'+formname+'.'+preP+'.options[24]=tempoption;');
cityareacode[23]=new Array('510100','510181','510182','510183','510184','510300','510400','510500','510600','510681','510682','510683','510700','510781','510800','510900','511000','511100','511181','511300','511381','511400','511500','511600','511681','511700','511781','511800','511900','512000','512081','513401');
cityareaname[23]=new Array('成都市','都江堰市','彭州市','邛崃市','崇州市','自贡市','攀枝花市','泸州市','德阳市','广汉市','什邡市','绵竹市','绵阳市','江油市','广元市','遂宁市','内江市','乐山市','峨眉山市','南充市','阆中市','眉山市','宜宾市','广安市','华蓥市','达州市','万源市','雅安市','巴中市','资阳市','简阳市','西昌市');
if (selectP=='25')
{ a=25;tempoption=new Option('贵州','贵',false,true); }
else
{ tempoption=new Option('贵州','贵'); }
eval('document.'+formname+'.'+preP+'.options[25]=tempoption;');
cityareacode[24]=new Array('520100','520181','520200','520300','520381','520382','520400','522201','522301','522401','522601','522701','522702');
cityareaname[24]=new Array('贵阳市','清镇市','六盘水市','遵义市','赤水市','仁怀市','安顺市','铜仁市','兴义市','毕节市','凯里市','都匀市','福泉市');
if (selectP=='26')
{ a=26;tempoption=new Option('云南','云',false,true); }
else
{ tempoption=new Option('云南','云'); }
eval('document.'+formname+'.'+preP+'.options[26]=tempoption;');
cityareacode[25]=new Array('530100','530181','530300','530381','530400','530500','530600','530700','530800','530900','532301','532501','532502','532801','532901','533102','533103');
cityareaname[25]=new Array('昆明市','安宁市','曲靖市','宣威市','玉溪市','保山市','昭通市','丽江市','思茅市','临沧市','楚雄市','个旧市','开远市','景洪市','大理市','瑞丽市','潞西市');
if (selectP=='27')
{ a=27;tempoption=new Option('西藏','藏',false,true); }
else
{ tempoption=new Option('西藏','藏'); }
eval('document.'+formname+'.'+preP+'.options[27]=tempoption;');
cityareacode[26]=new Array('540100','542301');
cityareaname[26]=new Array('拉萨市','日喀则市');
if (selectP=='28')
{ a=28;tempoption=new Option('陕西','陕',false,true); }
else
{ tempoption=new Option('陕西','陕'); }
eval('document.'+formname+'.'+preP+'.options[28]=tempoption;');
cityareacode[27]=new Array('610100','610200','610300','610400','610481','610500','610581','610582','610600','610700','610800','610900','611000');
cityareaname[27]=new Array('西安市','铜川市','宝鸡市','咸阳市','兴平市','渭南市','韩城市','华阴市','延安市','汉中市','榆林市','安康市','商洛市');
if (selectP=='29')
{ a=29;tempoption=new Option('甘肃','甘',false,true); }
else
{ tempoption=new Option('甘肃','甘'); }
eval('document.'+formname+'.'+preP+'.options[29]=tempoption;');
cityareacode[28]=new Array('620100','620200','620300','620400','620500','620600','620700','620800','620900','620981','620982','621000','621100','621200','622901','623001');
cityareaname[28]=new Array('兰州市','嘉峪关市','金昌市','白银市','天水市','武威市','张掖市','平凉市','酒泉市','玉门市','敦煌市','庆阳市','定西市','陇南市','临夏市','合作市');
if (selectP=='30')
{ a=30;tempoption=new Option('青海','青',false,true); }
else
{ tempoption=new Option('青海','青'); }
eval('document.'+formname+'.'+preP+'.options[30]=tempoption;');
cityareacode[29]=new Array('630100');
cityareaname[29]=new Array('西宁市');
if (selectP=='31')
{ a=31;tempoption=new Option('宁夏','宁',false,true); }
else
{ tempoption=new Option('宁夏','宁'); }
eval('document.'+formname+'.'+preP+'.options[31]=tempoption;');
cityareacode[30]=new Array('640100','640181','640200','640300','640381','640400','640500');
cityareaname[30]=new Array('银川市','灵武市','石嘴山市','吴忠市','青铜峡市','固原市','中卫市');
eval('document.'+formname+'.'+preP+'.options[a].selected=true;');
cityid=selectP;
if (cityid!='0')
{
b=0;for (i=0;i<cityareaname[cityid-1].length;i++)
{
if (selectC==cityareacode[cityid-1][i])
{b=i+1;tempoption=new Option(cityareaname[cityid-1][i],cityareacode[cityid-1][i],false,true);}
else
tempoption=new Option(cityareaname[cityid-1][i],cityareacode[cityid-1][i]);
eval('document.'+formname+'.'+preC+'.options[i+1]=tempoption;');
}
eval('document.'+formname+'.'+preC+'.options[b].selected=true;');
}
}
function selectcityarea(preP,preC,formname)
{
cityid=eval('document.'+formname+'.'+preP+'.selectedIndex;');
j=eval('document.'+formname+'.'+preC+'.length;');
for (i=1;i<j;i++)
{eval('document.'+formname+'.'+preC+'.options[j-i]=null;')}
if (cityid!="0")
{
for (i=0;i<cityareaname[cityid-1].length;i++)
{
tempoption=new Option(cityareaname[cityid-1][i],cityareacode[cityid-1][i]);
eval('document.'+formname+'.'+preC+'.options[i+1]=tempoption;');
}
}
}
